# ICentralLockedCallback Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ICentralLockedCallback Members
ICentralLockedCallback Interface Methods See Also
---
The ICentralLockedCallback type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ShouldWaitForLockAvailability | Returns whether Revit should wait and try again to acquire the lock on central. |

# See Also
ICentralLockedCallback Interface
Autodesk.Revit.DB Namespace